{
  "products": [
    {
      "id": 1,
      "title": "ЭЛЕКТРОМАГНИТНЫЙ РАСХОДОМЕР РУДНИЧНОГО ИСПОЛНЕНИЯ MERA EFM EX",
      "category": "Расходомеры. Рудничное исполнение",
      "description": "Сертифицирован в России для применения на рудниках и шахтах во взрывоопасных зонах",
      "desc_full": "Уровень взрывозащиты – РО согласно ТР ТС 012/2011; Входная и выходная искробезопасная электрическая цепь уровня \"ia\" по ГОСТ 30852.10-2002; Внесен в Реестр средств измерений России; Диапазон измерения 0,0024-6600 м3/час.; Погрешность 0,5%; Широкий спектр материалов электродов и футеровок; Определение пустого трубопровода, возможность измерения расхода в обоих направлениях; Прямые участки 5хDn до и 2хDn после расходомера; Самодиагностика с регистрацией ошибок; Многофункциональные выходы и вход для систем управления; Поддержка протокола Modbus (RTU, ASCII),;Длительный срок эксплуатации; Срок поверки 4 года; Гарантия – 24 месяца",
      "img": "https://i.yapx.ru/VwczY.jpg"
    },
    {
      "id": 2,
      "title": "ЭЛЕКТРОМАГНИТНЫЙ РАСХОДОМЕР MERA EFM",
      "category": "Расходомеры. Общепромышленное исполнение",
      "description": "Широкий спектр применения и возможностей в любой сфере промышленности",
      "desc_full": "Диапазон измерения от 0,1 до 10 м/с.; Погрешность 0,5%; Широкий спектр материалов электродов и футеровок; Определение пустого трубопровода; Измерение в обоих направлениях; Прямые участки 5хDn до и 2хDn после; Самодиагностика с регистрацией ошибок; Многофункциональные выходы и вход для систем управления; Поддержка протокола Modbus (RTU, ASCII, TCP), Profibus DP, CANopen; Внесен в реестр средств измерений России; Длительный срок эксплуатации; Срок поверки 4 года; Гарантия – 24 месяца",
      "img": "https://i.yapx.ru/VwczX.jpg"
    },
    {
      "id": 3,
      "title": "ЭЛЕКТРОМАГНИТНЫЙ РАСХОДОМЕР MERA SFM",
      "category": "Расходомеры. Общепромышленное исполнение",
      "description": "Оптимальное соотношение цены и качества",
      "desc_full": "Внесен в реестр средств измерений России; Диапазон измерения от 0 до 10 м/с.; Погрешность 0,5%; Широкий спектр материалов электродов и футеровок; Определение пустого трубопровода, возможность измерения в обоих направлениях; Прямые участки 5хDn до и 2хDn после; Многофункциональные выходы и вход для систем управления; Длительный срок эксплуатации; Срок поверки 4 года; Гарантия – 12 месяцев",
      "img": "https://i.yapx.ru/VwczV.jpg"
    },
    {
      "id": 4,
      "title": "РЕЛЕ ПОТОКА MERA FS306",
      "category": "Реле потока. Вода",
      "description": "Универсальность, DN 32 … 200, сменные лопасти из нержавеющей стали, микропереключатель для обеспечения высокой нагрузки на контакт",
      "desc_full": "Реле потока лопастное предназначено для контроля наличия/отсутствия потока жидкости в промышленных системах, охлаждающих и водоочистных установках. Реле потока используется для защиты насосов, двигателей и другого оборудования от перегрева, вызванного слабым потоком или его отсутствием.; Простое укорачивание лопасти на необходимую длину; Лопасть из армированного стекловолокном пластика или нержавеющей стали для более высокого расхода; Резьбовые штуцеры для установки в тройники или непосредственно в трубу; Простой монтаж с помощью накидной гайки",
      "img": "https://i.yapx.ru/VwczU.png"
    },
    {
      "id": 5,
      "title": "РЕЛЕ ПОТОКА MERA FS780",
      "category": "Реле потока. Вода",
      "description": "Простое укорачивание лопасти на необходимую длину, лопасть из нержавеющей стали, простой непосредственный монтаж в существующий трубопровод",
      "desc_full": "Универсальные реле потока для установки в трубы номин. диаметра DN 32 … 200; Лопасть из нержавеющей стали; Простой непосредственный монтаж в существующий трубопровод; Микропереключатель для обеспечения высокой допустимой нагрузки на контакт",
      "img": "https://i.yapx.ru/VwczT.jpg"
    },
    {
      "id": 6,
      "title": "РЕЛЕ ПОТОКА MERA FS781",
      "category": "Реле потока. Воздух",
      "description": "Фланцевое соединение, лопасть из нержавеющей стали, регулируемая точка переключения, микропереключатель для обеспечения высокой нагрузки на контакт",
      "desc_full": "Универсальные реле потока воздуха; Фланцевое соединение для плоских воздушных каналов; Лопасть из нержавеющей стали; Регулируемая точка переключения; Микропереключатель для обеспечения высокой допустимой нагрузки на контакт",
      "img": "https://i.yapx.ru/VwczR.jpg"
    }
  ],

  "orders": []
}


